In [1]:
import pandas as pd

In [2]:
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

In [3]:
employee

   id  salary
0   1     100
1   2     200
2   3     300

In [8]:
employee['range'] = employee[['salary']].rank(method='dense', ascending=False)
employee

   id  salary  range
0   1     100    3.0
1   2     200    2.0
2   3     300    1.0

In [9]:
salary_series = employee[employee['range'] == 2]['salary']

In [12]:
None if len(salary_series)==0 else salary_series.iloc[0]

In [18]:
pd.DataFrame([None if len(salary_series)==0 else salary_series.iloc[0]], columns=['SecondHighestSalary'])

   SecondHighestSalary
0                  200

In [20]:
pd.DataFrame({'SecondHighestSalary' : [None if len(salary_series)==0 else salary_series.iloc[0]]})

   SecondHighestSalary
0                  200